
## Plan Result (terraform/cloudflare/b0xp.io/argocd)

[CI link](https://github.com/boxp/arch/actions/runs/8751323994)


<pre><code>Plan: 7 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_ssm_parameter.argocd_tunnel_token
  * cloudflare_access_application.argocd
  * cloudflare_access_policy.argocd_policy
  * cloudflare_record.argocd
  * cloudflare_tunnel.argocd_tunnel
  * cloudflare_tunnel_config.argocd_tunnel
  * random_password.tunnel_secret


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ssm_parameter.argocd_tunnel_token will be created
  + resource "aws_ssm_parameter" "argocd_tunnel_token" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "for argocd tunnel token"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "argocd-tunnel-token"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # cloudflare_access_application.argocd will be created
  + resource "cloudflare_access_application" "argocd" {
      + account_id                = (known after apply)
      + app_launcher_visible      = true
      + aud                       = (known after apply)
      + auto_redirect_to_identity = false
      + domain                    = "argocd.b0xp.io"
      + enable_binding_cookie     = false
      + id                        = (known after apply)
      + name                      = "Access application for argocd.b0xp.io"
      + service_auth_401_redirect = false
      + session_duration          = "24h"
      + skip_interstitial         = false
      + type                      = "self_hosted"
      + zone_id                   = "ec593206d0ef695c3aae3a4cb3173264"
    }

  # cloudflare_access_policy.argocd_policy will be created
  + resource "cloudflare_access_policy" "argocd_policy" {
      + account_id     = (known after apply)
      + application_id = (known after apply)
      + decision       = "allow"
      + id             = (known after apply)
      + name           = "policy for argocd.b0xp.io"
      + precedence     = 1
      + zone_id        = "ec593206d0ef695c3aae3a4cb3173264"

      + include {
          + login_method = [
              + "b9248b7d-c1fa-48ab-8a43-ebffe03fabac",
            ]
        }
    }

  # cloudflare_record.argocd will be created
  + resource "cloudflare_record" "argocd" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "argocd"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "ec593206d0ef695c3aae3a4cb3173264"
    }

  # cloudflare_tunnel.argocd_tunnel will be created
  + resource "cloudflare_tunnel" "argocd_tunnel" {
      + account_id   = "1984a4314b3e75f3bedce97c7a8e0c81"
      + cname        = (known after apply)
      + id           = (known after apply)
      + name         = "cloudflare argocd tunnel"
      + secret       = (sensitive value)
      + tunnel_token = (sensitive value)
    }

  # cloudflare_tunnel_config.argocd_tunnel will be created
  + resource "cloudflare_tunnel_config" "argocd_tunnel" {
      + account_id = "1984a4314b3e75f3bedce97c7a8e0c81"
      + id         = (known after apply)
      + tunnel_id  = (known after apply)

      + config {
          + ingress_rule {
              + hostname = (known after apply)
              + service  = "http://argocd-server:80"
            }
          + ingress_rule {
              + service = "http_status:404"
            }
        }
    }

  # random_password.tunnel_secret will be created
  + resource "random_password" "tunnel_secret" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 64
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

Plan: 7 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":263,"Program":"tfcmt","SHA1":"361346fd1d22a4eb793cd89ef28d3bd05dd4028f","Target":"terraform/cloudflare/b0xp.io/argocd","Vars":{},"WorkflowName":"pull_request_target"} -->